attacker/data/scaling/spoofing/ab_results/ab_63.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   74.216 seconds
Complete requests:      20
Failed requests:        0
Keep-Alive requests:    20
Total transferred:      4880 bytes
HTML transferred:       1900 bytes
Requests per second:    0.27 [#/sec] (mean)
Time per request:       37107.901 [ms] (mean)
Time per request:       3710.790 [ms] (mean, across all concurrent requests)
Transfer rate:          0.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   11  39.5      3     179
Processing:    97 3822 14939.7    141   66963
Waiting:       96 3822 14938.9    140   66959
Total:         97 3833 14978.8    141   67142

Percentage of the requests served within a certain time (ms)
  50%    141
  66%    175
  75%    189
  80%    216
  90%   6960
  95%  67142
  98%  67142
  99%  67142
 100%  67142 (longest request)
